Catalogs/Полки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Полки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Стеллажи</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляЯрлыка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЯчейкиХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ЯчейкиХранения</Name>
			<Comment>Места хранения ячеистого склад</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СкладыКомпании</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДлинаЯчейки</Name>
					<Comment>Длина ячейки в единицах размерности склада-владельца</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЯчейки</Name>
					<Comment>Ширина ячейки в единицах размерности склада-владельца</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоординатаX</Name>
					<Comment>Координата X ячейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоординатаY</Name>
					<Comment>Координата Y ячейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Comment>Координата Z ячейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветГруппы</Name>
					<Comment>Цвет ячеек, входящих в данную группу, для отображения в карте склада. </Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недоступна</Name>
					<Comment>Признак доступности (активности ) ячейки. Например, ячейка недоступна, если она сломана, красится и т.д.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтараяЯчейка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Зоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ряд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ряды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стеллаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стеллажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Полка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Полки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЯчейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Полки/Ext/ObjectModule.bsl
Перем НужноМенятьПодчиненные;

Процедура ПередЗаписью(Отказ)
	ИдентификаторДляЯрлыкаДляПроверки = ПривестиИдентификатор(ИдентификаторДляЯрлыка);
	
	Если Ссылка.ИдентификаторДляЯрлыка <> ИдентификаторДляЯрлыкаДляПроверки Тогда
		ИдентификаторДляЯрлыка = ИдентификаторДляЯрлыкаДляПроверки;
		Код = Владелец.Код + "-"+ИдентификаторДляЯрлыка;
	КонецЕсли;
	
	Если Ссылка.Код <> Код ИЛИ ПометкаУдаления Тогда
		НужноМенятьПодчиненные = истина;
	КонецЕсли;
КонецПроцедуры

Функция ПривестиИдентификатор(Идентификатор)
	Попытка 
		Идентификатор = Формат(Число(СокрЛП(Идентификатор)), "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0");
	Исключение
		Идентификатор = СокрЛП(Идентификатор);
	КонецПопытки;
	Возврат Идентификатор;
КонецФункции

Процедура ПриЗаписи(Отказ)
	Если НЕ ОТказ И НужноМенятьПодчиненные <> Неопределено И НужноМенятьПодчиненные  Тогда
		НачатьТранзакцию();
		Попытка
			ЗапросПодчиненных = Новый Запрос();
			ЗапросПодчиненных.Текст = "ВЫБРАТЬ
			                          |	ЯчейкиХранения.Ссылка
			                          |ИЗ
			                          |	Справочник.ЯчейкиХранения КАК ЯчейкиХранения
			                          |ГДЕ
			                          |	ЯчейкиХранения.Полка = &Полка";
			ЗапросПодчиненных.УстановитьПараметр("Полка", Ссылка);
			
			ВыборкаПодчиненных = ЗапросПодчиненных.Выполнить().Выбрать();
			Пока ВыборкаПодчиненных.Следующий() Цикл
				ПодчиненныйОбъект = ВыборкаПодчиненных.Ссылка.ПолучитьОбъект();
				ПодчиненныйОбъект.Код = Код + "-" + ПодчиненныйОбъект.НомерЯчейки;
				ПодчиненныйОбъект.ПометкаУдаления = ПодчиненныйОбъект.ПометкаУдаления ИЛИ ПометкаУдаления;
				ПодчиненныйОбъект.Записать();
			КонецЦикла;
		Исключение
			Сообщить(ОписаниеОшибки());
			ОтменитьТранзакцию();
			Отказ = истина;
			Сообщить("Не удалось изменить идентификатор для вложенных элементов. Смена имени полки невозможна");
			Возврат;
		КонецПопытки;
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры
